#### SetVisibility Method

---

|  |
| --- |
| GenericForm Class   See Also |

Sets the visibility for the generic form.

**Namespace:**   Autodesk.Revit.DB
  **Assembly:**   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)

# Syntax

| C# |
| --- |
| ``` public void SetVisibility( 	FamilyElementVisibility visibility ) ``` |

| Visual Basic |
| --- |
| ``` Public Sub SetVisibility ( _ 	visibility As FamilyElementVisibility _ ) ``` |

| Visual C++ |
| --- |
| ``` public: void SetVisibility( 	FamilyElementVisibility^ visibility ) ``` |

#### Parameters

visibility
:   Type:  Autodesk.Revit.DB FamilyElementVisibility

# Remarks

The visibility of the generic form geometry can be changed for different types of views and detail levels in the project.

# Exceptions

| Exception | Condition |
| --- | --- |
| Autodesk.Revit.Exceptions ArgumentNullException | Thrown when visibility is    a null reference (  Nothing  in Visual Basic)  . |
| Autodesk.Revit.Exceptions InvalidOperationException | Thrown when regeneration failed. |

# See Also

GenericForm Class

Autodesk.Revit.DB Namespace